#include <iostream>

//lfie
//Windows-1251 59 61 73 6b 65 76 69 63 68 56 61 6c 65 72 69 61 32 30 30 35 00 
//UTF-8 59 00 61 00 73 00 6b 00 65 00 76 00 69 00 63 00 68 00 56 00 61 00 6c 00 65 00 72 00 69 00 61 00 32 00 30 00 30 00 35 00 00 00 
//UTF-16 59 00 61 00 73 00 6b 00 65 00 76 00 69 00 63 00 68 00 56 00 61 00 6c 00 65 00 72 00 69 00 61 00 32 00 30 00 30 00 35 00 00 00

//rfie
//Windows-1251  df f1 ea e5 e2 e8 f7 c2 e0 eb e5 f0 e8 ff 32 30 30 35 00
//UTF-8 2f 04 41 04 3a 04 35 04 32 04 38 04 47 04 12 04 30 04 3b 04 35 04 40 04 38 04 4f 04 32 00 30 00 30 00 35 00 00 00
//UTF-16 04 41 04 3a 04 35 04 32 04 38 04 47 04 12 04 30 04 3b 04 35 04 40 04 38 04 4f 04 32 00 30 00 30 00 35 00 00 00

//lr
//Windows-1251  df f1 ea e5 e2 e8 f7 32 30 30 35 56 61 6c 65 72 69 61 00
//UTF-82f 04 41 04 3a 04 35 04 32 04 38 04 47 04 32 00 30 00 30 00 35 00 56 00 61 00 6c 00 65 00 72 00 69 00 61 00 00 00
//UTF-16 04 41 04 3a 04 35 04 32 04 38 04 47 04 32 00 30 00 30 00 35 00 56 00 61 00 6c 00 65 00 72 00 69 00 61 00 00 00

int main()
{
	int number = 0x12345678;
	char hello[] = "Hello, ";
	char lfie[] = "YaskevichValeria2005"; 
	char rfie[] = "ЯскевичВалерия2005";
	char lr[] = "Яскевич2005Valeria";

	wchar_t Lfie[] = L"YaskevichValeria2005";
	wchar_t Rfie[] = L"ЯскевичВалерия2005";
	wchar_t LR[] = L"Яскевич2005Valeria";

	std::cout << hello << lfie << std::endl;
	return 0;
}